fio_test/log/128k/128k_seq_rw_8job_QD1.log
libpmem: (g=0): rw=rw, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libpmem, iodepth=1
...
fio-3.20
Starting 8 threads
libpmem: Laying out IO file (1 file / 4096MiB)
libpmem: Laying out IO file (1 file / 4096MiB)
libpmem: Laying out IO file (1 file / 4096MiB)
[...]

libpmem: (groupid=0, jobs=8): err= 0: pid=44520: Fri Mar  5 07:50:09 2021
  read: IOPS=51.2k, BW=6397MiB/s (6708MB/s)(1874GiB/300001msec)
    clat (nsec): min=26816, max=85062, avg=35921.44, stdev=2178.66
     lat (nsec): min=26835, max=85083, avg=35945.18, stdev=2178.66
    clat percentiles (nsec):
     |  1.00th=[31360],  5.00th=[32640], 10.00th=[33024], 20.00th=[34048],
     | 30.00th=[34560], 40.00th=[35072], 50.00th=[35584], 60.00th=[36096],
     | 70.00th=[37120], 80.00th=[37632], 90.00th=[38656], 95.00th=[39680],
     | 99.00th=[41728], 99.50th=[42240], 99.90th=[44800], 99.95th=[46336],
     | 99.99th=[51968]
   bw (  MiB/s): min= 5965, max= 6779, per=100.00%, avg=6405.50, stdev=16.29, samples=4792
   iops        : min=47720, max=54234, avg=51243.97, stdev=130.34, samples=4792
  write: IOPS=51.1k, BW=6393MiB/s (6704MB/s)(1873GiB/300001msec); 0 zone resets
    clat (usec): min=73, max=494, avg=117.90, stdev=16.14
     lat (usec): min=74, max=495, avg=118.57, stdev=16.14
    clat percentiles (usec):
     |  1.00th=[   88],  5.00th=[   95], 10.00th=[   99], 20.00th=[  104],
     | 30.00th=[  109], 40.00th=[  113], 50.00th=[  117], 60.00th=[  121],
     | 70.00th=[  125], 80.00th=[  131], 90.00th=[  139], 95.00th=[  147],
     | 99.00th=[  163], 99.50th=[  169], 99.90th=[  184], 99.95th=[  190],
     | 99.99th=[  202]
   bw (  MiB/s): min= 6091, max= 6551, per=100.00%, avg=6401.55, stdev= 7.67, samples=4792
   iops        : min=48734, max=52414, avg=51212.40, stdev=61.33, samples=4792
  lat (usec)   : 50=50.01%, 100=6.12%, 250=43.87%, 500=0.01%
  cpu          : usr=99.90%, sys=0.01%, ctx=699, majf=0, minf=23004
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=15352657,15343231,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=6397MiB/s (6708MB/s), 6397MiB/s-6397MiB/s (6708MB/s-6708MB/s), io=1874GiB (2012GB), run=300001-300001msec
  WRITE: bw=6393MiB/s (6704MB/s), 6393MiB/s-6393MiB/s (6704MB/s-6704MB/s), io=1873GiB (2011GB), run=300001-300001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%