fio_test/log/128k/128k_seq_write_16job_QD1.log
libpmem: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libpmem, iodepth=1
...
fio-3.20
Starting 16 threads
libpmem: Laying out IO file (1 file / 4096MiB)
libpmem: Laying out IO file (1 file / 4096MiB)
libpmem: Laying out IO file (1 file / 4096MiB)
[...]

libpmem: (groupid=0, jobs=16): err= 0: pid=40197: Fri Mar  5 02:53:39 2021
  write: IOPS=57.0k, BW=7130MiB/s (7477MB/s)(2089GiB/300001msec); 0 zone resets
    clat (usec): min=75, max=885, avg=276.85, stdev=41.61
     lat (usec): min=76, max=887, avg=277.51, stdev=41.61
    clat percentiles (usec):
     |  1.00th=[  208],  5.00th=[  221], 10.00th=[  231], 20.00th=[  241],
     | 30.00th=[  251], 40.00th=[  262], 50.00th=[  273], 60.00th=[  281],
     | 70.00th=[  293], 80.00th=[  310], 90.00th=[  334], 95.00th=[  355],
     | 99.00th=[  400], 99.50th=[  416], 99.90th=[  457], 99.95th=[  474],
     | 99.99th=[  515]
   bw (  MiB/s): min= 6638, max= 7245, per=100.00%, avg=7142.56, stdev= 5.10, samples=9568
   iops        : min=53104, max=57964, avg=57140.49, stdev=40.77, samples=9568
  lat (usec)   : 100=0.01%, 250=28.47%, 500=71.52%, 750=0.02%, 1000=0.01%
  cpu          : usr=99.90%, sys=0.01%, ctx=1460, majf=0, minf=32769
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,17113168,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=7130MiB/s (7477MB/s), 7130MiB/s-7130MiB/s (7477MB/s-7477MB/s), io=2089GiB (2243GB), run=300001-300001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%